// 3050370 2008-08-25 20:38:23 Accepted 1652 C++ 00:00.01 388K 呆滞的慢板 

// 把 Z 型线看作一曲线，假设原来平面上有 An-1 个块

// 某一（延伸向无穷远）的曲线，如果与当前平面上的线有 k 个交点

// 那么将产生额外的 k + 1 个块

// 对于本题，增加第 n 个块的时候，平面上有 n-1 个 Z
// 有 An-1 个块，这时候，新增的块顶多和原来的每个 Z 产生 9 个交点
// 共计 9*(n-1) 个，于是得到递推式：

// An   = An-1 + 9 * ( n - 1 ) + 1， 另： 
// An-1 = An-2 + 9 * ( n - 2 ) + 1 
// ...
// A2   = A1   + 9 * 1         + 1 
// A1   = A0   + 0             + 1
// A0   =                        1

// 两边求和，得到：
// An = 9 * ( 0 + 1 + 2 + ... + n - 1 ) + ( n + 1 ) 
//    = ( 9 * n * n - 7 * n + 2 ) / 2; 

#include <cstdio>

int     n;

int main() {
    
    while( scanf( "%d", &n ) != EOF )
        printf( "%d\n", (9*n-7)*n+2>>1 );

}
